yektaayduk/yus-repo/Bots/quad_lpc1114/src/user/main.c

#include "LPC11xx.h"
#include "CoOS.h"
#include "driver_config.h"
#include "target_config.h"

#include "gpio.h"
#include "xuart.h"
#include "quadtasks.h"

// from remote joystick
#define DATA_START				0x55
#define MAX_TIMEOUT_COUNT		100 // tick delays
#define MAX_JOYSTICK_RAD		10 // radius value

/* led blinker task */
#define PRIORITY_BLINK_TASK			7
#define SIZE_BLINK_TASK				50
OS_STK stkBlink[SIZE_BLINK_TASK];
void taskBlink(void *param);

/* user task */
#define PRIORITY_USER_TASK			6
#define SIZE_USER_TASK				200
OS_STK stkUser[SIZE_USER_TASK];
void taskUser(void *param);


int main(void)
{
	CoInitOS();

	/* Create Blink Task */
	CoCreateTask( taskBlink,
				  (void *)0,
				  PRIORITY_BLINK_TASK,
			      &stkBlink[SIZE_BLINK_TASK-1],
			      SIZE_BLINK_TASK );

	/* Quadruped tasks*/
	CreateQuadTasks();

	/* Create User Task */
	CoCreateTask( taskUser,
				  (void *)0,
				  PRIORITY_USER_TASK,
			      &stkUser[SIZE_USER_TASK-1],
			      SIZE_USER_TASK );

	CoStartOS();

	while(1);
}

void taskBlink(void *param)
{
	/* Enable GPIO block clock */
	GPIOInit();

	/* Set LED port pin to output */
	GPIOSetDir( LED_PORT, LED_BIT, 1 );

	for(;;) {
		/* Turn On Led */
		GPIOSetValue( LED_PORT, LED_BIT, LED_ON );
		CoTickDelay(10);	/* Delay 100ms */

		/* Turn Off Led */
		GPIOSetValue( LED_PORT, LED_BIT, LED_OFF );
		CoTickDelay(90);	/* Delay 900ms */
	}
}

void taskUser(void *param)
{
	// joystick data
	uint8_t radiusL, angleL;
	uint8_t radiusR, angleR;
	uint8_t cnt = 0;

	xuart_init(57600);
	g_QuadMovement = CENTER_POS;
	CoTickDelay(200);

	for(;;){
		if( !uart_test() ) {
			// no commands received
			if( ++cnt > MAX_TIMEOUT_COUNT ) {
				g_QuadMovement = CENTER_POS;
				cnt = 0;
			}
			CoTickDelay(1);
			continue;
		}
		if( uart_getc() != DATA_START) continue;
		cnt = 0;
		GPIOSetValue( LED_PORT, LED_BIT, LED_ON );
		radiusL = uart_getc();	angleL = uart_getc();
		radiusR = uart_getc();	angleR = uart_getc();

		if( !radiusL && !radiusR ) continue; // "null" data

		if(radiusR<5)
			goto incline_pos;
		if(angleR>=33 || angleR<3)
			goto quadruped_gait;
		if(angleR>=6 && angleR<12)
			goto lift_leg;
		continue;

quadruped_gait:
		if(radiusL) {
			g_StepDelay = MIN_STEP_DELAY + ((MAX_JOYSTICK_RAD-radiusL)>>1);
			if( angleL>=35 || angleL<5 )
				g_QuadMovement = FORWARD;
			else if( angleL>=5 && angleL<9 )
				g_QuadMovement = LEFTWARD;
			else if( angleL>=9 && angleL<15 )
				g_QuadMovement = LEFT_TURN;
			else if( angleL>=15 && angleL<21 )
				g_QuadMovement = BACKWARD;
			else if( angleL>=21 && angleL<27 )
				g_QuadMovement = RIGHT_TURN;
			else if( angleL>=27 && angleL<35 )
				g_QuadMovement = RIGHTWARD;
		}
		else g_QuadMovement = CENTER_POS;
		goto end;

incline_pos:
		g_InclineAngle = (angleL<<3) + (angleL<<1); // angle x 10
		g_QuadMovement = INCLINED_POS;
		goto end;

lift_leg:
		g_LiftLevel = radiusL<<1;
		if( angleL>=1 && angleL<7 ) { //45
			g_QuadMovement = LIFT_LEG_A;
			g_LiftAngle = (angleL-1)<<3;
		}
		else if( angleL>=10 && angleL<16 ) { //135
			g_QuadMovement = LIFT_LEG_B;
			g_LiftAngle = (angleL-10)<<3;
		}
		else if( angleL>=28 && angleL<36 ) { //315
			g_QuadMovement = LIFT_LEG_C;
			g_LiftAngle = (angleL-28)<<3;
		}
		else if( angleL>=19 && angleL<27 ) { //225
			g_QuadMovement = LIFT_LEG_D;
			g_LiftAngle = (angleL-19)<<3;
		}
		else g_QuadMovement = CENTER_POS;
		goto end;

end:
		CoTickDelay(1);
	}
}

